// prettier-ignore
const quizData2 = [ 
  { id: 3, q: "受取手形を銀行で割引し残額が当座預金口座に振り込まれた。", dr: "当座預金","手形売却損", cr: "受取手形", options: ["現金", "売掛金", "買掛金", "支払手形", "売上", "仕入", "電子記録債権", "電子記録債務", "手形売却損", "支払手形割引料"] },
  { id: 4, q: "電子記録債権を銀行で割引し、残額が当座預金口座に振込まれた。", dr: "当座預金","電子記録債権売却損" cr: "電子記録債権", options: ["現金", "売掛金", "買掛金", "受取手形", "支払手形", "売上", "仕入", "電子記録債務", "手形売却損", "電子記録債権売却損"] },
  { id: 10, q: "売買目的有価証券を売却し、代金は当座預金口座に振込まれた（売却益が発生）。", dr: "当座預金", cr: "有価証券","有価証券売却益", options: ["現金", "売掛金", "買掛金", "受取手形", "支払手形", "売上", "仕入", "有価証券評価損", "有価証券評価益", "有価証券売却益"] },
  { id: 13, q: "所有する機械装置を売却し、代金は後日受け取ることとした（売却損が発生）。", dr: "未収入金", cr: "機械装置", options: ["現金", "当座預金", "売掛金", "買掛金", "受取手形", "支払手形", "固定資産売却益", "固定資産売却損", "減価償却累計額", "工具器具備品"] },
  { id: 25, q: "自己株式を処分し、処分差益を資本剰余金として処理した。", dr: "当座預金", cr: "自己株式処分差益", options: ["現金", "売掛金", "買掛金", "受取手形", "支払手形", "売上", "仕入", "自己株式", "資本準備金", "利益準備金"] },
  { id: 35, q: "非支配株主に対する当期純利益の帰属額を配分する。", dr: "非支配株主損益", cr: "非支配株主持分", options: ["現金", "当座預金", "親会社株主", "利益剰余金", "資本剰余金", "売上", "仕入", "売掛金", "買掛金", "資本金"] },





];